const canvas = document.createElement('canvas');
const ctx = canvas.getContext('2d');
document.querySelector('.stars').appendChild(canvas);
canvas.width = window.innerWidth;
canvas.height = window.innerHeight;

let stars = [];
let numStars = 100;
const starSpeed = 0.7;

function initStars() {
    stars = [];
    for (let i = 0; i < numStars; i++) {
        stars.push({
            x: Math.random() * canvas.width,
            y: Math.random() * canvas.height,
            z: Math.random() * canvas.width
        });
    }
}

function moveStars() {
    ctx.clearRect(0, 0, canvas.width, canvas.height);
    for (let i = 0; i < stars.length; i++) {
        stars[i].z -= starSpeed;
        if (stars[i].z <= 0) {
            stars[i].z = canvas.width;
        }

        const k = 128.0 / stars[i].z;
        const px = stars[i].x * k + canvas.width / 2;
        const py = stars[i].y * k + canvas.height / 2;

        if (px >= 0 && px <= canvas.width && py >= 0 && py <= canvas.height) {
            const size = (1 - stars[i].z / canvas.width) * 5;
            const shade = parseInt((1 - stars[i].z / canvas.width) * 255);
            ctx.fillStyle = `rgb(${shade}, ${shade}, 255)`;
            ctx.beginPath();
            ctx.arc(px, py, size, 0, Math.PI * 2);
            ctx.fill();
        }
    }

    requestAnimationFrame(moveStars);
}

initStars();
moveStars();

window.addEventListener('resize', () => {
    canvas.width = window.innerWidth;
    canvas.height = window.innerHeight;
    initStars();
});

const feesData = {
     "جامعة السليمانية": {
        "كلية الطب": [
            { "القسم": "طب عام", "القسط": "5,500,000" },
            { "القسم": "طب اسنان", "القسط": "5,500,000" },
            { "القسم": "صيدلية", "القسط": "5,500,000" },
            { "القسم": "التمريض", "القسط": "2,200,000" },
            { "القسم": "الطب البيطري", "القسط": "2,200,000" }
        ],
        "كلية الهندسة": [
            { "القسم": "هندسة معماري", "القسط": "2,750,000" },
            { "القسم": "هندسة مدني", "القسط": "2,200,000" },
            { "القسم": "هندسة كهرباء", "القسط": "1,650,000" },
            { "القسم": "هندسة نفط", "القسط": "1,650,000" },
            { "القسم": "هندسة تخطيط مدني", "القسط": "1,650,000" },
            { "القسم": "هندسة ميكانيك", "القسط": "1,650,000" },
            { "القسم": "هندسة برمجيات", "القسط": "2,200,000" }
        ],
        "كلية العلوم": [
            { "القسم": "بايولوجي", "القسط": "1,375,000" },
            { "القسم": "الكيمياء", "القسط": "1,375,000" },
            { "القسم": "الفيزياء", "القسط": "1,375,000" },
            { "القسم": "جيولوجي", "القسط": "1,100,000" },
            { "القسم": "كومبيوتر", "القسط": "1,375,000" },
            { "القسم": "الرياضيات", "القسط": "1,100,000" }
        ],
        "كلية القانون": [
            { "القسم": "قانون", "القسط": "1,100,000" },
            { "القسم": "علوم سياسية", "القسط": "875,000" }
        ],
        "كلية التربية": [
            { "القسم": "بايولوجي", "القسط": "1,100,000" },
            { "القسم": "الكيمياء", "القسط": "1,100,000" },
            { "القسم": "الفيزياء", "القسط": "875,000" },
            { "القسم": "الرياضيات", "القسط": "875,000" }
        ],
        "كلية التربية الأساس": [
            { "القسم": "علوم الاجتماعيات", "القسط": "875,000" },
            { "القسم": "إنكليزي", "القسط": "1,100,000" },
            { "القسم": "الرياضيات", "القسط": "875,000" },
            { "القسم": "كومبيوتر", "القسط": "875,000" },
            { "القسم": "كوردي", "القسط": "875,000" },
            { "القسم": "تربية رياضة", "القسط": "875,000" },
            { "القسم": "تربية خاصة", "القسط": "875,000" },
            { "القسم": "تربية فنية", "القسط": "875,000" }
        ],
        "كلية الاَداب": [
            { "القسم": "تاريخ", "القسط": "550,000" },
            { "القسم": "جغرافيا", "القسط": "550,000" },
            { "القسم": "اَثار", "القسط": "550,000" },
            { "القسم": "الاجتماع", "القسط": "550,000" }
        ],
        "كلية اللغات": [
            { "القسم": "الترجمة", "القسط": "875,000" },
            { "القسم": "إنكليزي", "القسط": "875,000" },
            { "القسم": "فارسي", "القسط": "550,000" },
            { "القسم": "عربي", "القسط": "550,000" },
            { "القسم": "كوردي", "القسط": "550,000" }
        ],
        "الكلية التقنية": [
            { "القسم": "تخدير", "القسط": "1,650,000" },
            { "القسم": "تمريض", "القسط": "1,650,000" },
            { "القسم": "تحليلات مرضية", "القسط": "1,650,000" },
            { "القسم": "علوم مختبرات", "القسط": "1,650,000" }
        ],
        "كلية الإدارة والاقتصاد": [
            { "القسم": "إدارة الاعمال", "القسط": "875,000" },
            { "القسم": "المحاسبة", "القسط": "875,000" },
            { "القسم": "إدارة التسويق", "القسط": "550,000" },
            { "القسم": "اقتصاد", "القسط": "550,000" },
            { "القسم": "إحصاء", "القسط": "550,000" }
        ],
        "كلية الفنون": [
            { "القسم": "موسيقى", "القسط": "875,000" },
            { "القسم": "سينما", "القسط": "875,000" }
        ],
        "كلية الدراسات الاسلامية": [
            { "القسم": "الفقه واصوله", "القسط": "550,000" },
            { "القسم": "جميع الأقسام الإسلامية", "القسط": "550,000" }
        ],
        "كلية التجارة": [
            { "القسم": "محاسبة إدارة", "القسط": "875,000" },
            { "القسم": "تقنية المعلومات", "القسط": "875,000" },
            { "القسم": "مالية وبنوك", "القسط": "875,000" },
            { "القسم": "سياحة", "القسط": "875,000" }
        ],
        "المعاهد": [
            { "القسم": "المعهد الطبي", "القسط": "1,100,000" },
            { "القسم": "معهد تكنولوجيا", "القسط": "825,000" },
            { "القسم": "معهد كومبيوتر", "القسط": "825,000" },
            { "القسم": "معهد هندسة", "القسط": "825,000" },
            { "القسم": "معهد الإدارة", "القسط": "825,000" }
        ]
     },
        // بيانات جامعة سليمانية التقنية
    "جامعة سليمانية التقنية": {
        "الكلية التقنية": [
            { "القسم": "تمريض", "القسط": "1,650,000" },
            { "القسم": "تحليلات مرضية", "القسط": "1,650,000" },
            { "القسم": "تقنية تخدير", "القسط": "1,650,000" },
            { "القسم": "هندسة اتصالات", "القسط": "1,650,000" },
            { "القسم": "هندسة ميكانيك", "القسط": "1,650,000" },
            { "القسم": "هندسة نفط وطاقة", "القسط": "1,650,000" },
            { "القسم": "هندسة طاقة كهربائية", "القسط": "1,650,000" },
            { "القسم": "هندسة تخطيط", "القسط": "1,650,000" },
            { "القسم": "تكنولوجيا معلومات", "القسط": "1,375,000" },
            { "القسم": "تكنولوجيا داتا بيس", "القسط": "1,375,000" },
            { "القسم": "شبكات الكومبيوتر", "القسط": "1,375,000" },
            { "القسم": "تقنية اعمال", "القسط": "1,100,000" },
            { "القسم": "تقنية وسائل الاعلام", "القسط": "1,100,000" },
            { "القسم": "علاقات والتسويق", "القسط": "1,100,000" }
        ],
        "الكلية التقنية – حلبجة": [
            { "القسم": "علوم مختبرات طبية", "القسط": "1,650,000" },
            { "القسم": "علوم الأغذية", "القسط": "1,100,000" },
            { "القسم": "ادارة المراكز السياحية", "القسط": "1,100,000" }
        ],
        "كلية معهد سليمانية التقني": [
            { "القسم": "اشعة", "القسط": "1,100,000" },
            { "القسم": "صيدلة", "القسط": "1,100,000" },
            { "القسم": "مساعد طبيب اسنان", "القسط": "1,100,000" },
            { "القسم": "تمريض", "القسط": "1,100,000" },
            { "القسم": "تمريض أطفال", "القسط": "1,100,000" },
            { "القسم": "تخدير", "القسط": "1,100,000" },
            { "القسم": "ولادة", "القسط": "1,100,000" },
            { "القسم": "تحليلات مرضية", "القسط": "1,100,000" },
            { "القسم": "صحة مجتمع", "القسط": "1,100,000" },
            { "القسم": "ادارة اعمال", "القسط": "550,000" },
            { "القسم": "محاسبة", "القسط": "550,000" },
            { "القسم": "مساح", "القسط": "825,000" },
            { "القسم": "اتصالات", "القسط": "825,000" },
            { "القسم": "تقنية معماري", "القسط": "825,000" },
            { "القسم": "تقنية وسائل الاعلام", "القسط": "550,000" },
            { "القسم": "ميكانيك", "القسط": "825,000" }
        ],
        "كلية معهد التقني وعلوم كومبيوتر": [
            { "القسم": "انظمة داتا بيس", "القسط": "825,000" },
            { "القسم": "شبكات", "القسط": "825,000" },
            { "القسم": "تقنية المعلومات", "القسط": "825,000" }
        ],
        "تمريض – بنجوين": [
            { "القسم": "تمريض", "القسط": "1,100,000" }
        ],
        "ادارة اعمال – بنجوين": [
            { "القسم": "ادارة اعمال", "القسط": "550,000" }
        ],
        "كلية معهد التقني – بكرجو": [
            { "القسم": "ادارة الألكترونيات", "القسط": "550,000" },
            { "القسم": "الزراعة المحمية", "القسط": "825,000" },
            { "القسم": "علوم الأغذية", "القسط": "825,000" },
            { "القسم": "البستنة وتصميم", "القسط": "825,000" }
        ],
        "كلية معهد تقني – حلبجة": [
            { "القسم": "تحليلات مرضية", "القسط": "1,100,000" },
            { "القسم": "تمريض", "القسط": "1,100,000" },
            { "القسم": "ادارة اعمال", "القسط": "550,000" },
            { "القسم": "محاسبة", "القسط": "550,000" }
        ],
        "كلية معهد تقني – دوكان": [
            { "القسم": "ادارة اعمال", "القسط": "550,000" },
            { "القسم": "محاسبة", "القسط": "550,000" },
            { "القسم": "ادارة بنوك", "القسط": "550,000" },
            { "القسم": "علاقات والتسويق", "القسط": "550,000" },
            { "القسم": "تقنية المعلومات", "القسط": "825,000" }
        ],
        "كلية معهد التقني – جمجمال": [
            { "القسم": "تمريض", "القسط": "1,100,000" },
            { "القسم": "تأسيسات الكهرباء", "القسط": "825,000" },
            { "القسم": "تقنية معلومات", "القسط": "825,000" },
            { "القسم": "ادارة اعمال", "القسط": "550,000" },
            { "القسم": "محاسبة", "القسط": "550,000" }
        ],
        "كلية معهد التقني – دربنديخان": [
            { "القسم": "تمريض", "القسط": "1,100,000" },
            { "القسم": "كهرباء", "القسط": "825,000" },
            { "القسم": "محاسبة", "القسط": "550,000" },
            { "القسم": "ادارة اعمال", "القسط": "550,000" },
            { "القسم": "مساح", "القسط": "825,000" },
            { "القسم": "علوم كومبيوتر", "القسط": "825,000" }
        ],
        "كلية معهد التقني – كلار": [
            { "القسم": "تحليلات مرضية", "القسط": "1,100,000" },
            { "القسم": "تمريض", "القسط": "1,100,000" },
            { "القسم": "تقني بيطرة", "القسط": "1,100,000" },
            { "القسم": "مساح", "القسط": "825,000" },
            { "القسم": "كهرباء", "القسط": "825,000" },
            { "القسم": "تقنية معلومات", "القسط": "825,000" },
            { "القسم": "التكيف والتبريد", "القسط": "825,000" },
            { "القسم": "محاسبة", "القسط": "550,000" },
            { "القسم": "ادارة اعمال", "القسط": "550,000" },
            { "القسم": "ادارة المراكز السياحية", "القسط": "550,000" }
        ] 
    },
    
    // بيانات جامعة دهوك
    "جامعة دهوك": {
        "كلية الطب": [
            { "القسم": "طب عام", "القسط": "5,500,000" },
            { "القسم": "طب اسنان", "القسط": "5,500,000" },
            { "القسم": "صيدلة", "القسط": "5,500,000" },
            { "القسم": "تمريض", "القسط": "2,200,000" },
            { "القسم": "طب بيطري", "القسط": "1,650,000" },
            { "القسم": "تحليلات طبية", "القسط": "2,200,000" },
            { "القسم": "تخدير", "القسط": "2,200,000" }
        ],
        "كلية الهندسة": [
            { "القسم": "معماري", "القسط": "2,750,000" },
            { "القسم": "مدني", "القسط": "2,750,000" },
            { "القسم": "كهرباء وكومبيوتر", "القسط": "2,750,000" },
            { "القسم": "ميكانيك", "القسط": "2,750,000" },
            { "القسم": "مساح", "القسط": "2,750,000" }
        ],
        "كلية الاداب": [
            { "القسم": "إنكليزي", "القسط": "1,100,000" },
            { "القسم": "كوردي", "القسط": "1,100,000" },
            { "القسم": "ترجمة", "القسط": "1,100,000" },
            { "القسم": "تاريخ", "القسط": "1,100,000" },
            { "القسم": "جغرافيا", "القسط": "1,100,000" },
            { "القسم": "علم الاجتماع", "القسط": "825,000" },
            { "القسم": "السلام وحقوق الانسان", "القسط": "825,000" },
            { "القسم": "دراسة إسلامية", "القسط": "825,000" },
            { "القسم": "دراما", "القسط": "825,000" }
        ],
        "كلية القانون": [
            { "القسم": "قانون", "القسط": "1,100,000" }
        ],
        "كلية العلوم": [
            { "القسم": "علوم سياسية", "القسط": "1,100,000" },
            { "القسم": "بايولوجي", "القسط": "1,375,000" },
            { "القسم": "كيمياء", "القسط": "1,375,000" },
            { "القسم": "فيزياء", "القسط": "1,375,000" },
            { "القسم": "رياضيات", "القسط": "1,375,000" },
            { "القسم": "كومبيوتر", "القسط": "1,375,000" },
            { "القسم": "جيولوجي", "القسط": "1,375,000" }
        ],
        "كلية الزراعة": [
            { "القسم": "جميع اقسام الزراعة", "القسط": "825,000" }
        ],
        "كلية الإدارة والاقتصاد": [
            { "القسم": "إحصاء", "القسط": "1,100,000" },
            { "القسم": "إدارة اعمال", "القسط": "1,100,000" },
            { "القسم": "محاسبة", "القسط": "1,100,000" },
            { "القسم": "اقتصاد", "القسط": "1,100,000" },
            { "القسم": "علوم مالية وبنوك", "القسط": "1,100,000" },
            { "القسم": "سياحة وإدارة فنادق", "القسط": "1,100,000" }
        ],
        "كلية تربية أساس": [
            { "القسم": "كوردي", "القسط": "1,100,000" },
            { "القسم": "إنكليزي", "القسط": "1,100,000" },
            { "القسم": "جغرافيا", "القسط": "1,100,000" },
            { "القسم": "تاريخ", "القسط": "1,100,000" },
            { "القسم": "رياضيات", "القسط": "1,100,000" },
            { "القسم": "علم نفس", "القسط": "1,100,000" },
            { "القسم": "تربية خاصة", "القسط": "1,100,000" }
        ],
        "كلية التربية – عقرة": [
            { "القسم": "عربي", "القسط": "1,100,000" },
            { "القسم": "تاريخ", "القسط": "1,100,000" },
            { "القسم": "كوردي", "القسط": "1,100,000" },
            { "القسم": "إنكليزي", "القسط": "1,100,000" },
            { "القسم": "رياضيات", "القسط": "1,100,000" },
            { "القسم": "احياء", "القسط": "1,100,000" }
        ],
        "كلية تربية أساس – عمادية": [
            { "القسم": "اجتماعيات", "القسط": "1,100,000" },
            { "القسم": "إنكليزي", "القسط": "1,100,000" }
        ]
    },
        
        
        
        
      // بيانات جامعة دهوك التقنية
    "جامعة دهوك التقنية": {
        "الكلية التقنية": [
            { "القسم": "هندسة طاقة", "القسط": "1,925,000" },
            { "القسم": "هندسة كيماويات", "القسط": "1,925,000" },
            { "القسم": "هندسة طرق وجسور", "القسط": "1,925,000" },
            { "القسم": "تكنلوجيا إدارة معلومات", "القسط": "825,000" },
            { "القسم": "محاسبة", "القسط": "825,000" },
            { "القسم": "إدارة اعمال", "القسط": "825,000" }
        ],
        "كلية تقنية – عقرة": [
            { "القسم": "تكنولوجيا معلومات", "القسط": "825,000" },
            { "القسم": "حماية معلومات", "القسط": "825,000" },
            { "القسم": "إدارة اعمال", "القسط": "825,000" }
        ],
        "كلية تقنية – شيخان": [
            { "القسم": "صحة عامة", "القسط": "1,375,000" },
            { "القسم": "مختبرات طبية", "القسط": "1,650,000" },
            { "القسم": "جيولوجي بترول", "القسط": "1,375,000" }
        ],
        "كلية معهد دهوك التقني": [
            { "القسم": "صيدلة", "القسط": "1,375,000" },
            { "القسم": "مختبرات طبية", "القسط": "1,375,000" },
            { "القسم": "تمريض", "القسط": "1,375,000" },
            { "القسم": "مساح", "القسط": "962,000" },
            { "القسم": "تكنولوجيا معلومات", "القسط": "962,000" },
            { "القسم": "أنظمة معلومات الإدارة", "القسط": "825,000" },
            { "القسم": "إدارة اعمال", "القسط": "825,000" },
            { "القسم": "محاسبة", "القسط": "825,000" },
            { "القسم": "إدارة مستشفيات", "القسط": "825,000" },
            { "القسم": "اعلام", "القسط": "825,000" }
        ],
        "كلية معهد عقرة التقني": [
            { "القسم": "تمريض", "القسط": "1,375,000" },
            { "القسم": "ترجمة", "القسط": "678,000" },
            { "القسم": "إدارة قوانين", "القسط": "678,000" }
        ],
        "كلية معهد عمادية التقني": [
            { "القسم": "زراعة محمية", "القسط": "687,000" },
            { "القسم": "تكنولوجيا معلومات", "القسط": "962,000" },
            { "القسم": "مختبرات طبية", "القسط": "1,375,000" },
            { "القسم": "إدارة مراكز سياحية", "القسط": "825,000" },
            { "القسم": "إدارة اعمال", "القسط": "825,000" }
        ],
        "كلية معهد شيخان التقني": [
            { "القسم": "تكنولوجيا معلومات", "القسط": "962,000" },
            { "القسم": "إدارة اعمال", "القسط": "825,000" }
        ],
        "كلية معهد بردرش التقني": [
            { "القسم": "تكنولوجيا معلومات", "القسط": "825,000" },
            { "القسم": "إدارة اعمال", "القسط": "687,000" },
            { "القسم": "تمريض", "القسط": "1,375,000" },
            { "القسم": "محاسبة", "القسط": "825,000" },
            { "القسم": "شبكات", "القسط": "825,000" },
            { "القسم": "إدارة مستشفيات", "القسط": "687,000" }
        ],
        "كلية معهد شنكال التقني": [
            { "القسم": "تمريض", "القسط": "1,375,000" },
            { "القسم": "محاسبة", "القسط": "825,000" }
        ]  
        
        
        
        
    },
 // بيانات جامعة زاخو
    "جامعة زاخو": {
        "كلية الطب": [
            { "القسم": "طب عام", "القسط": "5,500,000" }
        ],
        "كلية الهندسة": [
            { "القسم": "بترول نفط", "القسط": "2,750,000" },
            { "القسم": "ميكانيك", "القسط": "2,200,000" }
        ],
        "كلية العلوم": [
            { "القسم": "بايولوجي", "القسط": "1,375,000" },
            { "القسم": "كيمياء", "القسط": "1,375,000" },
            { "القسم": "فيزياء", "القسط": "1,100,000" },
            { "القسم": "كومبيوتر", "القسط": "1,237,000" },
            { "القسم": "بيئة", "القسط": "1,100,000" },
            { "القسم": "رياضيات", "القسط": "1,100,000" }
        ],
        "كلية الاداب": [
            { "القسم": "إنكليزي", "القسط": "1,237,000" },
            { "القسم": "عربي", "القسط": "1,100,000" },
            { "القسم": "كوردي", "القسط": "1,100,000" },
            { "القسم": "تركي", "القسط": "1,100,000" },
            { "القسم": "تاريخ", "القسط": "1,100,000" },
            { "القسم": "دراسات إسلامية", "القسط": "1,100,000" }
        ],
        "كلية الإدارة والاقتصاد": [
            { "القسم": "اقتصاد", "القسط": "1,100,000" },
            { "القسم": "إدارة اعمال", "القسط": "1,100,000" },
            { "القسم": "علوم مالية وبنوك", "القسط": "1,100,000" }
        ],
        "كلية التربية": [
            { "القسم": "رياضة", "القسط": "1,100,000" },
            { "القسم": "جغرافيا", "القسط": "1,100,000" },
            { "القسم": "رياضيات", "القسط": "1,100,000" },
            { "القسم": "علم النفس", "القسط": "1,100,000" }
        ],
        "كلية تربية أساس": [
            { "القسم": "عربي", "القسط": "1,100,000" },
            { "القسم": "كوردي", "القسط": "1,100,000" },
            { "القسم": "إنكليزي", "القسط": "1,100,000" },
            { "القسم": "اجتماعيات", "القسط": "1,100,000" },
            { "القسم": "علوم عامة", "القسط": "1,100,000" }
        ]
    }
};


document.getElementById('university').addEventListener('change', function () {
    const collegeSelect = document.getElementById('college');
    collegeSelect.innerHTML = '<option value="">اختر الكلية</option>';
    const selectedUniversity = this.value;
    if (selectedUniversity && feesData[selectedUniversity]) {
        const colleges = Object.keys(feesData[selectedUniversity]);
        colleges.forEach(college => {
            const option = document.createElement('option');
            option.value = college;
            option.textContent = college;
            collegeSelect.appendChild(option);
        });
    }
});

function showFees() {
    const university = document.getElementById('university').value;
    const college = document.getElementById('college').value;
    const tableContainer = document.getElementById('feesTableContainer');
    tableContainer.innerHTML = '';

    if (university && college && feesData[university] && feesData[university][college]) {
        const fees = feesData[university][college];
        const table = document.createElement('table');
        const thead = document.createElement('thead');
        const tbody = document.createElement('tbody');

        thead.innerHTML = '<tr><th>القسم</th><th>القسط السنوي</th></tr>';
        fees.forEach(fee => {
            const row = document.createElement('tr');
            row.innerHTML = `<td>${fee['القسم']}</td><td>${fee['القسط']}</td>`; // تصحيح هنا
            tbody.appendChild(row);
        });

        table.appendChild(thead);
        table.appendChild(tbody);
        tableContainer.appendChild(table);

        // عرض الإشعار باسم الكلية المختارة
        showNotification(` ${college}`)
    } else {
        // في حال عدم وجود بيانات
       showNotification(`قم بأختيار الكلية فضلا ${college}`);
    }
}

function showNotification(message) {
    const notification = document.createElement('div');
    notification.className = 'notification';
    notification.textContent = message;
    document.body.appendChild(notification);

    // أضف الفئة show لبدء حركة الانزلاق
    setTimeout(() => {
        notification.classList.add('show');
    }, 10); // تأخير صغير للتأكد من أن الإشعار تم إضافته قبل إضافة الفئة

    // بعد 3 ثواني، ابدأ بإخفاء الإشعار
    setTimeout(() => {
        notification.classList.remove('show');
        notification.classList.add('fade-out');
        setTimeout(() => notification.remove(), 500); // إزالة الإشعار بعد الانتهاء من التأثير
    }, 3000); // يظهر الإشعار لمدة 3 ثواني
}


const menuButton = document.getElementById('menu-button');
    const sideMenu = document.getElementById('side-menu');
    
    // فتح القائمة الجانبية عند الضغط على زر القائمة
    menuButton.addEventListener('click', () => {
        sideMenu.classList.toggle('open');
    });

    // إغلاق القائمة الجانبية عند النقر في أي مكان داخل الموقع
    document.addEventListener('click', (e) => {
        if (!sideMenu.contains(e.target) && e.target !== menuButton) {
            sideMenu.classList.remove('open');
        }
    });

    // دالة لفتح صفحات الويب عند النقر على أزرار القائمة
    function openPage(url) {
        window.open(url, '_blank');
    }

    // استماع لحدث النقر على أزرار القائمة وفتح الصفحات المناسبة
    sideMenu.querySelectorAll('button').forEach(button => {
        button.addEventListener('click', () => {
            const url = button.dataset.url;
            if (url) {
                openPage(url);
            }
        });
 

 });
function openPage(url) {
    window.location.href = url;
}


// منع النسخ
document.addEventListener('copy', function(e) {
    e.preventDefault();
});

// منع استخدام قائمة السياق (النقر بزر الفأرة الأيمن)
document.addEventListener('contextmenu', function(e) {
    e.preventDefault();
});

// منع تحديد النصوص
document.addEventListener('selectstart', function(e) {
    e.preventDefault();
});

document.addEventListener('keydown', function(e) {
    if ((e.ctrlKey && e.key === 'c') || (e.ctrlKey && e.key === 'v')) {
        e.preventDefault();
    }
});

